---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.GetEnumerator
source: html/053ad5cb-5388-7db6-7f74-063e61370b05.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.GetEnumerator Method

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```